# Pandas Cheat Sheet

* cheat sheet: https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf
* source:인프런_단두장의 문서로 데이터 분석과 시각화 뽀개기 by 박조은강사님
* https://www.inflearn.com/course/%ED%8C%90%EB%8B%A4%EC%8A%A4-pandas/

In [1]:
import pandas as pd

## Syntax- creating Data Frames

Dictionary

In [4]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]},
        index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
df["a"] #열 가져오기 #대소문자 구분 해야함

1    4
2    5
3    6
Name: a, dtype: int64

In [10]:
df.loc[3] # 행가져오기

a     6
b     9
c    12
Name: 3, dtype: int64

In [11]:
df.loc[1,"a"] #loc[행,열]

4

In [14]:
df.loc[[1,2],["a","b"]] #대괄호로 묶어 여러행,열 호출 가능

   a  b
1  4  7
2  5  8

List

In [16]:
df = pd.DataFrame(
        [[4, 7, 10],
        [5, 8, 11],
        [6, 9, 12]],
        index=[1, 2, 3],
        columns=['a', 'b', 'c'])       #컬럼이름 별도지정. 
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

Tuple(Multi Index)

In [17]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2)],
        names=['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

## Subset Observations (Rows)

### 조건에 따라 불러오기

In [19]:
df[df.b>7] #조건에 해당하는 값이 있는  row 가져오기

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [20]:
df[df['c']>7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

### 중복값 제거하기

In [21]:
df.drop_duplicates() #중복값 제거 함수

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [27]:
df2 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6],
        "b" : [7, 8, 9, 9],
        "c" : [10, 11, 12, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2), ('e',3)],
        names=['n','v']))
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [28]:
df2.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [29]:
df2 # 변수에 저장을 해주지 않아 원래의 값이 출력된다.

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [30]:
df2=df2.drop_duplicates(keep='last')
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

### Logic in Python

In [32]:
df["b"] != 7 # 같지 않다 : ''!=''

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [34]:
df.a.isin([5]) #값 검색.  []로 묶어줘야한다.

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [36]:
pd.isnull(df) # null 값 검색

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False  False  False

In [42]:
import numpy as np
df3 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, np.nan, 9, 9],
        "c" : [10, 11, 12, np.nan, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',4)],
        names=['n','v']))
df3

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [43]:
df3['a'].isnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [44]:
df3['a'].isnull().sum() #null 값의 갯수

1

In [45]:
pd.notnull(df3) #null이 아닌 값

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [46]:
df3['a'].notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [47]:
df3['a'].notnull().sum()

4

* **and, or, not, xor, any, all**
* **&,|,~,^,df.any(),df.all()**         # data.frame에서는 기호로 사용해야함

In [49]:
df3[(df3.b == 7) | (df3.a == 5)]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0